===============
Unparenthesized
===============
scn scriptname
begin block
  eval $string
end
---
(script_file
  script_name: (script_name
    declaration: (script_declarator)
    script_name: (identifier))
    block_mode: (block
      block_type: (identifier)
      eval: (eval
        (unary_operator)
        plain: (identifier))))

=============
Parenthesized
=============
scn scriptname
begin block
  eval ($string)
end
---
(script_file
  script_name: (script_name
    declaration: (script_declarator)
    script_name: (identifier))
    block_mode: (block
      block_type: (identifier)
      eval: (eval
        (unary_operator)
        plain: (identifier))))

====================
Multiple expressions
====================
scn scriptname
begin block
  eval $string + $string2
end
---
(script_file
  script_name: (script_name
    declaration: (script_declarator)
    script_name: (identifier))
    block_mode: (block
      block_type: (identifier)
      eval: (eval
        (unary_operator)
        plain: (identifier)
        (binary_operator)
        (unary_operator)
        plain: (identifier))))

==================================
Parenthesized multiple expressions
==================================
scn scriptname
begin block
  eval (($string) + ($string2))
end
---
(script_file
  script_name: (script_name
    declaration: (script_declarator)
    script_name: (identifier))
    block_mode: (block
      block_type: (identifier)
      eval: (eval
        (unary_operator)
        plain: (identifier)
        (binary_operator)
        (unary_operator)
        plain: (identifier))))
